ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32U5/TARGET_STM32U585xI/TARGET_B_U585I_IOT02A/PeripheralPins.c
/* mbed Microcontroller Library
 * SPDX-License-Identifier: BSD-3-Clause
 ******************************************************************************
 *
 * Copyright (c) 2016-2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 *
 * Automatically generated from STM32CubeMX/db/mcu/STM32U585AIIxQ.xml
 */

#include "PeripheralPins.h"
#include "mbed_toolchain.h"

//==============================================================================
// Notes
//
// - The pins mentioned Px_y_ALTz are alternative possibilities which use other
//   HW peripheral instances. You can use them the same way as any other "normal"
//   pin (i.e. PwmOut pwm(PA_7_ALT0);). These pins are not displayed on the board
//   pinout image on mbed.org.
//
// - The pins which are connected to other components present on the board have
//   the comment "Connected to xxx". The pin function may not work properly in this
//   case. These pins may not be displayed on the board pinout image on mbed.org.
//   Please read the board reference manual and schematic for more information.
//
// - Warning: pins connected to the default STDIO_UART_TX and STDIO_UART_RX pins are commented
//   See https://os.mbed.com/teams/ST/wiki/STDIO for more information.
//
//==============================================================================


//*** GPIO ***

MBED_WEAK const PinMap PinMap_GPIO[] = {
    {PA_0,  0, GPIO_NOPULL},
    {PA_1,  0, GPIO_NOPULL},
    {PA_2,  0, GPIO_NOPULL},
    {PA_3,  0, GPIO_NOPULL},
    {PA_4,  0, GPIO_NOPULL},
    {PA_5,  0, GPIO_NOPULL},
    {PA_6,  0, GPIO_NOPULL},
    {PA_7,  0, GPIO_NOPULL},
    {PA_8,  0, GPIO_NOPULL},
//  {PA_9,  0, GPIO_NOPULL}, // Connected to STDIO_UART_TX
//  {PA_10, 0, GPIO_NOPULL}, // Connected to STDIO_UART_RX
    {PA_11, 0, GPIO_NOPULL}, // Connected to USB.C_P
    {PA_12, 0, GPIO_NOPULL}, // Connected to USB.C_P
    {PA_13, 0, GPIO_NOPULL},
    {PA_14, 0, GPIO_NOPULL},
    {PA_15, 0, GPIO_NOPULL},
    {PB_0,  0, GPIO_NOPULL},
    {PB_1,  0, GPIO_NOPULL}, // Connected to MIC.SDIN0
    {PB_2,  0, GPIO_NOPULL},
    {PB_3,  0, GPIO_NOPULL},
    {PB_4,  0, GPIO_NOPULL},
    {PB_5,  0, GPIO_NOPULL}, // Connected to UCPD_PWR
    {PB_6,  0, GPIO_NOPULL},
    {PB_7,  0, GPIO_NOPULL},
    {PB_8,  0, GPIO_PULLUP}, // Connected to I2C1_SCL
    {PB_9,  0, GPIO_PULLUP}, // Connected to I2C1_SDA
    {PB_10, 0, GPIO_NOPULL}, // Connected to OCTOSPI.R_CLK_P
    {PB_11, 0, GPIO_NOPULL}, // Connected to OCTOSPI.R_NCS
    {PB_12, 0, GPIO_NOPULL}, // Connected to WRLS.SPI2_NSS
    {PB_13, 0, GPIO_NOPULL},
    {PB_14, 0, GPIO_NOPULL},
    {PB_15, 0, GPIO_NOPULL}, // Connected to USB.UCPD_CC2
    {PC_0,  0, GPIO_NOPULL},
    {PC_1,  0, GPIO_NOPULL},
    {PC_2,  0, GPIO_NOPULL},
    {PC_3,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO6
    {PC_4,  0, GPIO_NOPULL},
    {PC_5,  0, GPIO_NOPULL},
    {PC_6,  0, GPIO_NOPULL},
    {PC_7,  0, GPIO_NOPULL},
    {PC_8,  0, GPIO_NOPULL},
    {PC_9,  0, GPIO_NOPULL},
    {PC_10, 0, GPIO_NOPULL}, // Connected to WRLS.UART4_TX
    {PC_11, 0, GPIO_NOPULL}, // Connected to WRLS.UART4_RX
    {PC_12, 0, GPIO_NOPULL},
    {PC_13, 0, GPIO_NOPULL}, // Connected to USER_Button
//  {PC_14, 0, GPIO_NOPULL}, // PC14-OSC32_IN (PC14)
//  {PC_15, 0, GPIO_NOPULL}, // PC15-OSC32_OUT (PC15)
    {PD_0,  0, GPIO_NOPULL},
    {PD_1,  0, GPIO_NOPULL}, // Connected to WRLS.SPI2_SCK
    {PD_2,  0, GPIO_NOPULL},
    {PD_3,  0, GPIO_NOPULL}, // Connected to WRLS.SPI2_MISO
    {PD_4,  0, GPIO_NOPULL}, // Connected to WRLS.SPI2_MOSI
    {PD_5,  0, GPIO_NOPULL},
    {PD_6,  0, GPIO_NOPULL},
    {PD_7,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO7
    {PD_8,  0, GPIO_NOPULL},
    {PD_9,  0, GPIO_NOPULL}, // Connected to Mems.INT_IIS2MDC
    {PD_10, 0, GPIO_NOPULL}, // Connected to Mems.INT_IIS2MDC
    {PD_11, 0, GPIO_NOPULL},
    {PD_12, 0, GPIO_NOPULL},
    {PD_13, 0, GPIO_NOPULL}, // Connected to USB.IANA
    {PD_14, 0, GPIO_NOPULL}, // Connected to WRLS.NOTIFY
    {PD_15, 0, GPIO_NOPULL},
    {PE_0,  0, GPIO_NOPULL},
    {PE_1,  0, GPIO_NOPULL},
    {PE_2,  0, GPIO_NOPULL},
    {PE_3,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_DQS
    {PE_4,  0, GPIO_NOPULL},
    {PE_5,  0, GPIO_NOPULL},
    {PE_6,  0, GPIO_NOPULL},
    {PE_7,  0, GPIO_NOPULL},
    {PE_8,  0, GPIO_NOPULL}, // Connected to USB.UCPD_FLT
    {PE_9,  0, GPIO_NOPULL}, // Connected to MIC.CCK0
    {PE_10, 0, GPIO_NOPULL}, // Connected to MIC.SDINx
    {PE_11, 0, GPIO_NOPULL}, // Connected to Mems.ISM330DLC_INT1
    {PE_12, 0, GPIO_NOPULL},
    {PE_13, 0, GPIO_PULLDOWN},
    {PE_14, 0, GPIO_NOPULL},
    {PE_15, 0, GPIO_NOPULL},
    {PF_0,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO0
    {PF_1,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO1
    {PF_2,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO2
    {PF_3,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO3
    {PF_4,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_CLK_P
    {PF_5,  0, GPIO_NOPULL},
    {PF_6,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO3
    {PF_7,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO2
    {PF_8,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO0
    {PF_9,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO1
    {PF_10, 0, GPIO_NOPULL}, // Connected to MIC.CCK1
    {PF_11, 0, GPIO_NOPULL}, // Connected to Mems.STSAFE_RESET
    {PF_12, 0, GPIO_NOPULL}, // Connected to OCTOSPI.F_DQS
    {PF_13, 0, GPIO_NOPULL},
    {PF_14, 0, GPIO_NOPULL}, // Connected to USB.VBUS_SENSE
    {PF_15, 0, GPIO_NOPULL}, // Connected to WRLS.WKUP_W
    {PG_0,  0, GPIO_NOPULL},
    {PG_1,  0, GPIO_NOPULL},
    {PG_2,  0, GPIO_NOPULL}, // Connected to Mems.INT_LPS22HH
    {PG_3,  0, GPIO_NOPULL},
    {PG_4,  0, GPIO_NOPULL},
    {PG_5,  0, GPIO_NOPULL}, // Connected to Mems.VLX_GPIO
    {PG_6,  0, GPIO_NOPULL}, // Connected to WRLS.WKUP_B
    {PG_7,  0, GPIO_NOPULL},
    {PG_8,  0, GPIO_NOPULL},
    {PG_9,  0, GPIO_NOPULL},
    {PG_10, 0, GPIO_NOPULL},
    {PG_12, 0, GPIO_NOPULL},
    {PG_15, 0, GPIO_NOPULL}, // Connected to WRLS.FLOW
//  {PH_0,  0, GPIO_NOPULL}, // PH0-OSC_IN (PH0)
//  {PH_1,  0, GPIO_NOPULL}, // PH1-OSC_OUT (PH1)
    {PH_2,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO4
    {PH_3,  0, GPIO_NOPULL}, // Connected to PH3-BOOT0 // PH3-BOOT0
    {PH_4,  0, GPIO_NOPULL}, // Connected to I2C2_SCL
    {PH_5,  0, GPIO_NOPULL}, // Connected to I2C2_SDA
    {PH_6,  0, GPIO_NOPULL}, // Connected to LED_RED
    {PH_7,  0, GPIO_NOPULL}, // Connected to LED_GREEN
    {PH_8,  0, GPIO_NOPULL},
    {PH_9,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO4
    {PH_10, 0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO5
    {PH_11, 0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO6
    {PH_12, 0, GPIO_NOPULL}, // Connected to OCTOSPI.F_IO7
    {PH_13, 0, GPIO_NOPULL},
    {PH_14, 0, GPIO_NOPULL},
    {PH_15, 0, GPIO_NOPULL},
    {PI_0,  0, GPIO_NOPULL}, // Connected to OCTOSPI.R_IO5
    {PI_1,  0, GPIO_NOPULL},
    {PI_2,  0, GPIO_NOPULL},
    {PI_3,  0, GPIO_NOPULL},
    {PI_4,  0, GPIO_NOPULL},
    {PI_5,  0, GPIO_NOPULL}, // Connected to OCTOSPI.F_NCS
    {PI_6,  0, GPIO_NOPULL},
    {PI_7,  0, GPIO_NOPULL},
    {NC, NC, 0}
};

//*** ADC ***

